Repository: KeppySoftware/KMC
Catalog: KeppyMIDIConverter/Languages/Lang.*.resx
Languages: es_es, zh_cn, zh_hk

# AbortConversion
source: Abort preview/conversion
es_es: Cancelar vista previa/conversion
zh_cn: 中断转换进程
zh_hk: 停止預覽或轉換

# ACFUWSTC
source: Automatically check for updates when starting the converter
es_es: Buscar actualizaciones automáticamente al iniciar
zh_cn: 每次启动软件时自动检查更新
zh_hk: 每次啓動軟體嘅時候自動檢查更新

# ActionsStrip
source: Actions
es_es: Acciones
zh_cn: 开始
zh_hk: 開始

# ASAR
source: Shut off the computer after rendering
es_es: Apagar su computadora después de la conversión
zh_cn: 转换完成后关闭计算机
zh_hk: 轉換完成后關閉電腦

source: Change language
es_es: Cambiar idioma
zh_cn: 语言Language
zh_hk: 語言Language

# ClearList
source: Clear MIDIs list
es_es: Borrar lista de MIDI
zh_cn: 清除MIDI列表
zh_hk: 清空MIDI列表

# CMLAR
source: Clear MIDIs list after rendering
es_es: Borrar la lista de MIDI después de renderizar
zh_cn: 转换完成后清除MIDI列表
zh_hk: 轉換結束之後就自動清空MIDI列表

# CSFFS
source: Enable sound notifications for the conversion status
es_es: Habilitar sonido para notificar el estado de conversión
zh_cn: 转换状态的效果音
zh_hk: 轉換狀態下嘅音效

source: Exit
es_es: Salir
zh_cn: 退出
zh_hk: 退出

# HelpStrip
source: Help
es_es: Ayuda
zh_cn: 帮助
zh_hk: 幫助

# IATP
source: Information about the program
es_es: Acerca del programa
zh_cn: 关于Keppy's MIDI Converter
zh_hk: 關於Keppy's MIDI Converter

source: Import MIDIs
es_es: Importar MIDIs
zh_cn: 添加MIDI
zh_hk: MIDI

# JKSUS
source: Join the Kep's Software Updates Server
es_es: Únete al servidor de actualizaciones de software de Keppy
zh_cn: 加入Keppy的更新软件服务器
zh_hk: 加入Keppy嘅軟體更新服務器

# KK99GP
source: KaleidonKep99's GitHub page
es_es: Pagina de GitHub de KaleidonKep99
zh_cn: 前往KaleidonKep99的GitHub页面
zh_hk: 前往KaleidonKep99的GitHub頁面

# KK99YTC
source: KaleidonKep99's YouTube channel
es_es: Canal de Youtube de KaleidonKep99
zh_cn: 前往KaleidonKep99的YouTube频道
zh_hk: 前往KaleidonKep99的YouTube頻道

source: Open settings
es_es: Abrir Configuracion
zh_cn: 打开设置界面
zh_hk: 打开設定介面

# OpenSFVSTManager
source: Open SoundFonts/VSTs manager
es_es: Abrir Administrador de Soundfonts/VST
zh_cn: 打开音色库/VST管理器
zh_hk: 打開音色庫/VST管理器

# OptionsStrip
source: Options
es_es: Opciones
zh_cn: 设置
zh_hk: 設定

# PreviewFiles
source: Preview MIDIs
es_es: Vista previa de MIDIs
zh_cn: 预览MIDI效果
zh_hk: 預覽MIDI效果

source: Remove MIDIs
es_es: Retirar MIDIs
zh_cn: 移除MIDI
zh_hk: 移除MIDI

source: Render mode
es_es: Modo de renderizado
zh_cn: 渲染模式
zh_hk: 渲染模式

source: Render to
es_es: Renderizar a
zh_cn: 渲染为
zh_hk: 渲染為

# SCPIOTL
source: Show conversion position instead of time left
es_es: Mostrar la posición de conversión en vez del tiempo restante
zh_cn: 显示剩余时间→显示播放位置
zh_hk: 顯示剩餘時間→顯示預覽位置

# STDWD
source: Support the developer with a donation
es_es: Apoya al desarrollador con una donación
zh_cn: 赞助我们伟大的开发者
zh_hk: 赞助我們偉大嘅開發者

source: Volume
es_es: Volumen
zh_cn: 音量
zh_hk: 音量

# ActiveVoices
source: Voices
es_es: Voces
zh_cn: 当前复音数
zh_hk: 目前的複音數

# AverageLevel
source: Average
es_es: Promedio
zh_cn: 平均
zh_hk: 平均

# ConnectionErrorDesc
source: The converter can not connect to the GitHub servers. Check your network connection, or contact your system administrator or network service provider. Press OK to continue and open the converter's window.
es_es: El convertidor no se puede conectar a los servidores de GitHub. Verifique su conexión de red o comuníquese con el administrador del sistema o el proveedor de servicios de red. Presione OK para continuar y abrir la ventana del convertidor.
zh_cn: 抱歉！这边连不上GitHub服务器呢。 请检查网络连接。或者试试挂个VPN看看是否有帮助。 点击好的来继续使用KMC。
zh_hk: 唔好意思！呢邊連唔上GitHub服務器。 請檢查您嘅網絡連接。或者試下開個VPN睇下有冇解決問題。 點解好的來繼續使用KMC。

# ConnectionErrorTitle
source: Connection error
es_es: Error de conexión
zh_cn: 网络连接失败啦。
zh_hk: 網絡鏈接失敗！

# DonateText
source: This project can not maintain itself by downloads only. I will not be able to keep this program updated forever, that's why a small donation from you could help me improve its features, and also help me improve the equipment that I work with. Donations are optional, and if you don't want to see this dialog anymore, just click on "Do not show this ever again". You can still donate by navigating to "Help > Help the developer with a donation". Thank you in advance.
zh_cn: 这个项目不能仅通过下载来维护自身。 我无法永远更新这个程序，所以你们的一笔小捐款可以帮助我改进它的功能，与我使用的设备。 捐款是可选的，如果你不想再看到这个对话框，只需点击“不再显示”。您仍然可以打开“帮助>赞助”进行捐款。 提前谢谢你啦。
zh_hk: 呢個項目唔能夠僅通過下載來維護自身。 我無辦法永遠更新呢個程序，所以您們嘅一筆小捐款可以協助我改進佢嘅功能，與我使用嘅設備。 捐款係可選嘅，如果您唔想再見到呢一個對話框，只需點擊“不再顯示”。您仍然可以打開“幫助>贊助”進行捐款。 提前多謝您啦。

# DontShowAnymore
source: I am not interested
es_es: No estoy interesado
zh_cn: 烦诶！不想再看到了啦！
zh_hk: 以後不再顯示

source: Fatal error
es_es: Error fatal
zh_cn: 关键性错误
zh_hk: 關鍵性錯誤

# FatalErrorHandler
source: Fatal error during the execution of Keppy's MIDI Converter! The application needs to be closed. Additional informations:
es_es: ¡Error fatal durante la ejecución del Keppy's MIDI Converter! La aplicación debe cerrarse. Información adicional:
zh_cn: 软件运行中发生关键性错误。 我们被迫将要关闭这个软件。 附加信息:
zh_hk: 軟體運行過程中發生關鍵性錯誤。 我們被迫將要關閉呢個軟件。 附加信息:

# IdleMessage
source: Waiting for user commands. Select a MIDI, load some soundfonts, and start the conversion/playback process!
es_es: Esperando los comandos del usuario. Select a MIDI, load some soundfonts, and start the conversion/playback process!
zh_cn: Keppy's MIDI Converter处于空闲状态。 选择一个MIDI，加载一些音色库，然后就可以转换/播放啦。
zh_hk: Keppy's MIDI Converter處於空閒狀態。 選擇一個MIDI，加載一些音色庫，然後就可以轉換/預覽啦。

# KeepAliveProject
source: Donate to keep the project alive
es_es: Dona para mantener vivo el proyecto
zh_cn: 赞助一下，救救软件吧
zh_hk: 贊助一下，拯救呢個項目啦。

# MoveDown
source: Move down (One item)
es_es: Mover abajo (un elemento)
zh_cn: 向下移动一格
zh_hk: 向下移動一格

# MoveUp
source: Move up (One item)
es_es: Mover arriba (un elemento)
zh_cn: 向上移动一格
zh_hk: 向上移動一格

# NonFatalErrorHandler
source: Something went wrong during the execution of the application. Additional informations:
es_es: Algo salió mal durante la ejecución de la aplicación. Additional informations:
zh_cn: 软件运行中发生错误。 附加信息:
zh_hk: 軟體運行過程中發生錯誤。 附加信息:

# NoUpdatesFound
source: {0} {1} is already up to date. Click "OK" to close this dialog.
es_es: {0} {1} ya esta actualizado. Click en "OK" para cerrar este cuadro.
zh_cn: {0} {1}已经是最新版啦。 点击确定关闭弹窗。
zh_hk: {0} {1}已經係最新嘅版本啦。 唔出意外嘅話，Keppy可能再都唔會更新啦...

# NoUpdatesFoundTitle
source: No updates for {0} {1} found
es_es: No se encontraron actualizaciones para {0} {1}
zh_cn: 没有发现{0} {1}的更新版本。
zh_hk: 冇發現{0} {1}嘅更新版本。

# PeakLevel
source: Peak
es_es: Cima
zh_cn: 峰值
zh_hk: 峰值

# RightClickCopyNotice
source: Right-click anywhere in the window to copy the message.
es_es: Click derecho en cualquier lugar de la ventana para copiar el mensaje.
zh_cn: 窗口内任意位置点击右键可复制信息。
zh_hk: 窗口內任意位置單擊右鍵可複製信息。

# RMS
source: Root mean square
es_es: Media cuadrática
zh_cn: 均方根
zh_hk: 均方根

# ShowMeNext
source: Remind me in one month
es_es: Recordar en un mes
zh_cn: 下个月再提醒我
zh_hk: 下個月再提醒我

# SortName
source: Sort by name
es_es: Ordenar por nombre
zh_cn: 按名称排序
zh_hk: 按名稱排序

# UpdateFound
source: A new update for {0} {1} has been found. Version installed: {2} Version available online: {3} Would you like to update now? If you choose "Yes", the converter will be automatically closed. You can disable the automatic update check through "Options > Automatically check for updates when starting the converter".)
es_es: Una nueva actualización para {0} {1} ha sido encontrada. Versión instalada: {2} Versión disponible en linea: {3} Te gustaría actualizar ahora? Si escogiste "Sí", el convertidor se cerrará automáticamente. Puede deshabilitar la verificación automática de actualizaciones a través de "Opciones > Buscar actualizaciones automáticamente al iniciar el convertidor".)
zh_cn: 发现了{0} {1}的新版本！ 当前版本：{2} 最新版本：{3} 主人现在想更新吗？ 如果选择“确定”，软件就会自动关闭。 （如果不想自动更新、可以关闭"设置 > 启动时自动检查更新"。）
zh_hk: 發現咗{0} {1}嘅新版本！ 當前版本：{2} 最新版本：{3} 您係咪想宜家就更新？ 如果選擇“確定”，軟體就會自動關閉。 （如果唔想自動更新、可以關閉"設定 > 啟動時自動檢查更新"。）

# UpdateFoundTitle
source: New version of {0} {1} found
es_es: Nueva versión de {0} {1} encontrada
zh_cn: 发现了{0} {1}的新版本
zh_hk: 發現咗{0} {1}嘅新版本

# NoAffectPreview
source: It doesn't affect previews
es_es: No afecta a las vistas previas
zh_cn: 放心，预览不受影响
zh_hk: 放心,預覽唔受影響

# RealTimeSim
source: Real-time simulation
es_es: Simulación en tiempo real(Real-time)
zh_cn: 实时模拟
zh_hk: 實時模擬（暫不支持渲染）

# RenderStandard
source: Standard
es_es: Estándar
zh_cn: 标准
zh_hk: 標準

# CFU
source: Check for updates
es_es: Buscar actualizaciones
zh_cn: 检查更新
zh_hk: 檢查更新

# CompilerDate
source: Compiled on:
es_es: Compilado en:
zh_cn: 编写日期：
zh_hk: 編寫日期：

# ConverterInfo
source: Information about this build
es_es: Información sobre esta compilación
zh_cn: 开发相关信息
zh_hk: 開發相關信息

# CTC
source: Copy to clipboard
es_es: Copiar al portapapeles
zh_cn: 复制到剪贴板
zh_hk: 複製到剪貼簿

# HowManyTimesAdd
source: How many times do you want to add this MIDI? {0}
es_es: ¿Cuántas veces desea agregar este MIDI? {0}
zh_cn: 你想添加多少次这个MIDI？ {0}
zh_hk: 您想添加多少次呢個MIDI？ {0}

# IgnoreSize
source: The converter will ignore the size of the MIDIs, and get their full info anyway.
es_es: El convertidor ignorará el tamaño de los MIDIs y obtendrá su info. completa de todos modos.
zh_cn: 转换器将忽略MIDI的大小，并获取其完整信息。
zh_hk: 轉換器將忽略MIDI嘅大小，並獲取其完整嘅信息。

source: Information
es_es: Informacion
zh_cn: 信息
zh_hk: 信息

# InvalidMIDIFile
source: {0} is not a valid MIDI file! Please select a valid MIDI file, and retry.
es_es: {0} no es un archivo MIDI válido!. Seleccione un archivo MIDI válido y vuelva a intentarlo.
zh_cn: {0} 这不是有效的MIDI格式！ 请换一个有效的MIDI吧。
zh_hk: {0}呢個唔係有效嘅MIDI格式！ 請更換一個有效嘅MIDI。

# MIDIFile
source: File
zh_cn: 文件
zh_hk: 文件

# MIDILength
source: Length
es_es: Duracion
zh_cn: 时长
zh_hk: 長度

# MIDINotes
source: Notes
es_es: Notas
zh_cn: 音符数
zh_hk: 音符數

# MIDISize
source: Size
es_es: Tamaño
zh_cn: 大小
zh_hk: 大小

# RevisionLabel
source: {0} (Revision {1})
zh_cn: {0}（修订{1}）
zh_hk: {0}（修訂{1}）

# SourceCodeText
source: Click here to open the official GitHub repository
es_es: Haga clic aquí para abrir el repositorio oficial de GitHub
zh_cn: 点击这里打开官方GitHub存储库
zh_hk: 點擊呢度打開官方GitHub存儲庫

# TaCI
source: Keppy's MIDI Converter {0} Copyright Ⓒ Riccardo Loi 2013-{1} Translation by {2}
es_es: Keppy's MIDI Converter {0} Copyright Ⓒ Riccardo Loi 2013-{1} Traducido por {2}
zh_cn: Keppy's MIDI Converter {0} 版权所有Ⓒ Riccardo Loi 2013-{1} 汉化：{2}
zh_hk: Keppy's MIDI Converter {0} 版權所有Ⓒ Riccardo Loi 2013-{1} 粵化：{2}

# Version
source: {0} version:
zh_cn: {0}版本：
zh_hk: {0}版本：

# VersionConverter
source: Converter
es_es: Convertidor
zh_cn: KMC
zh_hk: KMC

# W10VerRev
source: Version {0} (Revision {1})
zh_cn: 版本{0}（修订{1}）
zh_hk: 版本{0}（修訂{1}）

# WindowsBuild
source: Release build:
es_es: Versión de lanzamiento:
zh_cn: 发布版本：
zh_hk: 發佈版本：

# WindowsInstallInfo
source: Information about Windows
es_es: Información sobre Windows
zh_cn: Windows系统信息
zh_hk: Windows系統信息

# WindowsName
source: Release name:
es_es: Nombre de la versión:
zh_cn: 发布名称：
zh_hk: 發佈名稱：

# NoEnoughMemoryMIDIInfo
source: There's no enough memory to get the info for this MIDI: {0}
es_es: No hay suficiente memoria para obtener la información de este MIDI: {0}
zh_cn: 内存不足，无法获取此MIDI的信息： {0}
zh_hk: 內存不足，無法獲取此MIDI嘅信息： {0}

# AboutSFZFormatText
source: This program is compliant to the "SFZ 1.0 format", and partially with the "SFZ 2.0 format". Do you want to visit the "Unofficial SFZ format information" website?
es_es: Este programa es compatible con el "formato SFZ 1.0" y parcialmente con el "formato SFZ 2.0". ¿Desea visitar el sitio web "Información no oficial del formato SFZ"?
zh_cn: 该程序符合“SFZ 1.0格式”，部分符合“SFZ 2.0格式”。 想要去“非官方SFZ格式信息”网站看看吗？
zh_hk: 該程序符合“SFZ 1.0格式”，部分符合“SFZ 2.0格式”。 想要去“非官方SFZ格式信息”網站睇下嗎？

# AboutSFZFormatTitle
source: About the SFZ format
es_es: Acerca del formato SFZ
zh_cn: 关于SFZ格式
zh_hk: 關於SFZ格式

# AboutVSTSupportText
source: This program supports VST DSPs. Virtual Studio Technology (VST) is a software interface and technology by Steinberg Media Technologies. Copyright ©2006 Steinberg Media Technologies. All Rights Reserved.
es_es: Este programa es compatible con VST DSP. Virtual Studio Technology (VST) es una interfaz de software y tecnología de Steinberg Media Technologies. Copyright ©2006 Steinberg Media Technologies. Todos los derechos reservados.
zh_cn: 这个软件支持 VST DSP。 虚拟工作室技术（VST） 是斯坦伯格媒体技术公司开发的一种软件界面和技术。 版权所有 ©2006 Steinberg Media Technologies. 保留所有权利。
zh_hk: 呢個軟件支持 VST DSP。 Virtual Studio技術（VST） 係斯坦伯格媒體技術公司開發嘅一種軟件介面同技術。 版權所有 ©2006 Steinberg Media Technologies. 保留所有權利。

# AboutVSTSupportTitle
source: About the Virtual Studio Technology interface
es_es: Acerca de la interfaz de Virtual Studio Technology
zh_cn: 关于虚拟工作室技术界面
zh_hk: 關於Virtual Studio技術介面

# AdvSettingsTitle
source: Advanced settings
es_es: Ajustes avanzados
zh_cn: 进阶设置
zh_hk: 進階設定

# AudioFreq
source: Audio frequency:
es_es: Frecuencia de audio:
zh_cn: 音频采样率：
zh_hk: 音頻采樣率：

source: Bitrate
es_es: Taza de bits
zh_cn: 比特率：
zh_hk: 比特率：

# ClearSoundfontList
source: Clean soundfonts list
es_es: Limpiar listado de Soundfonts
zh_cn: 清除音色库列表
zh_hk: 清空音色庫列表

# ConstantBitrate
source: Force constant bitrate
es_es: Forzar tasa de bits constante
zh_cn: 强制恒定比特率
zh_hk: 強制恆定比特率

# ConverterIsBusyAlready
source: Wait for the previous conversion/preview to finish!
es_es: ¡Espere a que la conversión/vista previa anterior finalice!
zh_cn: 请等待上一个转换结束！
zh_hk: 請等候上一個轉換結束！

# ConvStatusFasterNew
source: {0}MBs of RAW data converted. ({1}) Approximate time left: {2} - Elapsed time: {3} Rendering time: {4}% ({5}x~ faster)
es_es: {0}MB de datos RAW convertidos. ({1}) Tiempo aproximado restante: {2} - Tiempo transcurrido: {3} Tiempo de renderizado: {4}% ({5}x~ mas rapido)
zh_cn: 已转换{0}MB的RAW数据。（{1}） 剩余时间：{2} - 经过时间：{3} 转换速度：{4}%（{5}x快速）
zh_hk: 已轉換{0}MB的RAW數據。（{1}） 剩餘時間：{2} - 經過時間：{3} 轉換速度：{4}%（{5}x快速）

# ConvStatusFasterOld
source: {0}MBs of RAW data converted. ({1}) Current position: {2} - {3} Rendering time: {4}% ({5}x~ faster)
es_es: {0}MB de datos RAW convertidos. ({1}) Posición actual: {2} - {3} Tiempo de renderizado: {4}% ({5}x~ mas rapido)
zh_cn: 已转换{0}MB的RAW数据。（{1}） 现在位置：{2} - {3} 转换速度：{4}%（{5}x快速）
zh_hk: 已轉換{0}MB的RAW數據。（{1}） 現在位置：{2} - {3} 轉換速度：{4}%（{5}x快速）

# ConvStatusNormalNew
source: {0}MBs of RAW data converted. ({1}) Approximate time left: {2} - Elapsed time: {3} Rendering time: {4}%
es_es: {0}MB de datos RAW convertidos. ({1}) Tiempo aproximado restante: {2} - Tiempo transcurrido: {3} Tiempo de renderizado: {4}%
zh_cn: 已转换{0}MB的RAW数据。（{1}） 剩余时间：{2} - 经过时间：{3} 转换速度：{4}%
zh_hk: 已轉換{0}MB的RAW數據。（{1}） 剩餘時間：{2} - 經過時間：{3} 轉換速度：{4}%

# ConvStatusNormalOld
source: {0}MBs of RAW data converted. ({1}) Current position: {2} - {3} Rendering time: {4}%
es_es: {0}MB de datos RAW convertidos. ({1}) Posición actual: {2} - {3} Tiempo de renderizado: {4}%
zh_cn: 已转换{0}MB的RAW数据。（{1}） 现在位置：{2} - {3} 转换速度：{4}%
zh_hk: 已轉換{0}MB的RAW數據。（{1}） 現在位置：{2} - {3} 轉換速度：{4}%

# ConvStatusSlowerNew
source: {0}MBs of RAW data converted. ({1}) Approximate time left: {2} - Elapsed time: {3} Rendering time: {4}% ({5}x~ slower)
es_es: {0}MB de datos RAW convertidos. ({1}) Tiempo aproximado restante: {2} - Tiempo transcurrido: {3} Tiempo de renderizado: {4}% ({5}x~ mas lento)
zh_cn: 已转换{0}MB的RAW数据。（{1}） 剩余时间：{2} - 经过时间：{3} 转换速度：{4}%（{5}x慢速）
zh_hk: 已轉換{0}MB的RAW數據。（{1}） 剩餘時間：{2} - 經過時間：{3} 轉換速度：{4}%（{5}x慢於播放速度）

# ConvStatusSlowerOld
source: {0}MBs of RAW data converted. ({1}) Current position: {2} - {3} Rendering time: {4}% ({5}x~ slower)
es_es: {0}MB de datos RAW convertidos. ({1}) Posición actual: {2} - {3} Tiempo de renderizado: {4}% ({5}x~ mas lento)
zh_cn: 已转换{0}MB的RAW数据。（{1}） 现在位置：{2} - {3} 转换速度：{4}%（{5}x慢速）
zh_hk: 已轉換{0}MB的RAW數據。（{1}） 現在位置：{2} - {3} 轉換速度：{4}%（{5}x慢於播放速度）

# DisableEffects
source: Disable sound effects
es_es: Desactivar efectos de sonido
zh_cn: 禁用声音效果
zh_hk: 禁用聲音效果

source: DSP settings:
es_es: Configuración de DSP:
zh_cn: DSP设置：
zh_hk: DSP設定：

# ExportMIDIWindow
source: Select a folder for the conversion process
es_es: Seleccione una carpeta para el proceso de conversión
zh_cn: 选择转换输出的文件夹
zh_hk: 選擇轉換輸出的文件夾

# ImportMIDIWindow
source: Select the MIDIs to import...
es_es: Seleccione los MIDIs para importar...
zh_cn: 选择需要导入的MIDI...
zh_hk: 選擇需要載入的MIDI...

# ImportSoundfontBtn
source: Import soundfont(s)
es_es: Importar soundfont(s)
zh_cn: 导入音色库
zh_hk: 載入音色庫

source: MIDI files
es_es: Archivos MIDI
zh_cn: MIDI文件
zh_hk: MIDI文件

# MoveDownSF
source: Move down ▼
es_es: Mover abajo ▼
zh_cn: 向下移动 ▼
zh_hk: 向下移動 ▼

# MoveUpSF
source: Move up ▲
es_es: Mover arriba ▲
zh_cn: 向上移动 ▲
zh_hk: 向上移動 ▲

# NoteOff1
source: Only release the oldest instance of a note upon note-off event.
es_es: Liberar solo la instancia más antigua de una nota en un evento de desactivación.
zh_cn: 只释放“结束音符”事件中最早的音符实例
zh_hk: 只釋放“結束音符”事件中最早的音符實例

# OverrideTempo
source: Override MIDI tempo
es_es: Anular el tempo MIDI
zh_cn: 覆盖MIDI原来的速度
zh_hk: 覆蓋MIDI原來的速度

# PlaybackStatusNormal
source: {0} of the MIDI played. Position: {1} - {2} Notes: {3} - {4} Playback speed: Normal
es_es: {0} del MIDI reproducido. Posicion: {1} - {2} Notas: {3} - {4} Velocidad de reproducción: Normal
zh_cn: MIDI已经播放了{0}。 播放位置：{1} - {2} 音符数：{3} - {4} 播放速度：默认
zh_hk: MIDI已經預覽咗{0}。 預覽位置：{1} - {2} 音符數：{3} - {4} 預覽速度：默認

# PlaybackText
source: {0} | Playback of {1}...
es_es: {0} | Reproducción de {1}...
zh_cn: {0} | 正在播放 {1}
zh_hk: {0} | 正在預覽 {1}

source: Real-Time framerate:
es_es: Velocidad de fotogramas en tiempo real(Real-time):
zh_cn: 实时帧速率：
zh_hk: 實時幀速率：

# RemoveSoundfontBtn
source: Remove soundfont(s)
es_es: Remover soundfont(s)
zh_cn: 移除音色库
zh_hk: 移除音色庫

source: Stream settings
es_es: Configuración de la transmisión
zh_cn: 流设置
zh_hk: 流設定

# SkipVSTSettings
source: The converter will not show you the VST settings.
es_es: El convertidor no le mostrará la configuración de VST.
zh_cn: 软件将跳过VST设置。
zh_hk: 軟件將跳過VST設定。

# SoundfontDialogMessage
source: Use up to 1.000 soundfonts at once, to convert your MIDIs. The last SoundFont will override the ones above it, loading order is from top to bottom. Check if the SoundFonts are not corrupted, before adding them to the list, to avoid random crashes/glitches. The following formats are supported: SF2, SF2PACK, SF3, SFZ
es_es: Utilice hasta 1.000 soundfonts a la vez para convertir sus MIDIs. El último SoundFont anulará los que están arriba, el orden de carga es de arriba a abajo. Compruebe si los SoundFonts no están dañados, antes de agregarlos a la lista, para evitar fallos o errores aleatorios. Los siguientes formatos son compatibles: SF2, SF2PACK, SF3, SFZ
zh_cn: 一次最多使用1.000种音色库来转换MIDI。 最后一个音色库将覆盖它上面的音色库，加载顺序是从上到下。 在将音色库添加到列表之前，请检查其是否已损坏，来避免音频损坏/故障。 支持以下格式：SF2、SF2PACK、SF3、SFZ
zh_hk: 一次最多使用1000種音色庫來轉換MIDI。 最後一個音色庫將覆蓋佢上面嘅音色庫，加載順序係從上到下。 喺將音色庫添加到列表之前，請檢查其是否已損壞，來避免音頻損壞/故障。 支持以下格式：SF2、SF2PACK、SF3、SFZ

# SoundfontImportError
source: This is not a valid soundfont! Select a soundfont and try again.
es_es: ¡Esta no es un soundfont válido! Seleccione un soundfont e intente de nuevo.
zh_cn: 这不是一个有效的音色库！ 请换一个有效的音色库吧。
zh_hk: 呢個唔係一個有效嘅音色庫！ 請換一個有效嘅音色庫啦。

# SoundfontManagerTitle
source: Soundfonts/VST manager
es_es: Administrador de Soundfonts/VST
zh_cn: 音色库/VST管理器
zh_hk: 音色庫/VST管理器

# VSTHowDoTheyWork
source: How do they work? Effect 1 will apply its effect to the audio, then it'll pass the modified audio to Effect 2, that will then do the same with Effect 3 and so on. It's a chain-like system.
es_es: ¿Cómo funciona? El efecto 1 aplicará su efecto al audio, luego pasará el audio modificado al efecto 2, que luego hará lo mismo con el efecto 3 y así sucesivamente. Es un sistema en forma de cadena.
zh_cn: 工作原理是怎样的呢？ 效果1将其效果应用于音频，然后将修改后的音频传递给效果2， 然后传递给效果3，依此类推。 这是一个链式系统。
zh_hk: 工作原理係點樣嘅呢？ 效果1將其效果應用於音頻，然後將修改後嘅音頻傳遞畀效果2， 然後傳遞畀效果3，以此類推。 呢個係一個鏈式系統。

# VSTInvalidCallError
source: There was an error while trying to load {0}. The VST can not be loaded. Error: {1} The VST is probably not compatible with the native Windows forms system. Error copied to clipboard.
es_es: Hubo un error al intentar cargar {0}. El VST no se puede cargar. Error: {1} El VST probablemente no sea compatible con el sistema nativo de formularios de Windows. Error copiado al portapapeles.
zh_cn: 加载{0}时发生了错误。 这个VST无法被加载。 错误： {1} VST可能与本机Windows窗体系统不兼容。 错误内容已复制到剪贴板。
zh_hk: 加載{0}是發生咗錯誤。 呢個VST無法被加載。 錯誤： {1} VST可能與本機Windows窗體系統不兼容。 錯誤內容已複製到剪貼簿。

# VSTInvalidCallTitle
source: Invalid VST call
es_es: Llamada VST no válida
zh_cn: VST调用无效
zh_hk: VST調用無效

source: VST manager
es_es: Administrador de VST
zh_cn: VST管理器
zh_hk: VST管理器

# VSTManagerButtonText
source: Open the VST DSP manager
es_es: Abre el administrador de VST DSP
zh_cn: 打开VST DSP管理器
zh_hk: 打開VST DSP管理器

# VSTUseText
source: Enable VST effects
es_es: Habilitar efectos VST
zh_cn: 启用VST效果
zh_hk: 啟用VST效果

# BNPSel
source: Selected a bank and a preset for the SoundFont
es_es: Selecciona un banco y un preset para SoundFont
zh_cn: 为音色库选择一个库和一个预设
zh_hk: 為音色庫選擇一個庫和一個預設

# BNPSelDesc
source: Please select a bank and a preset, from 0 to 127. Use "Bank 0" and "Preset 0" for the standard "Acoustic Grand Piano", or if you don't know which one you should use.
es_es: Seleccione un banco y un preset, de 0 a 127. Utilice "Bank 0" y "Preset 0" para el "Acoustic Grand Piano" estándar, o si no sabes cuál deberías usar para la conversion.
zh_cn: 请选择库和预设值，从0到127。 对标准的“原声大钢琴”使用“Bank 0”和“Preset 0”， 或者如果你不知道该用哪一个。
zh_hk: 請選擇庫和預設值，從0到127。 對標準嘅“原聲大鋼琴”使用“Bank 0”和“Preset 0”， 或者如果您唔知道該用邊一個。

# BNPSelHelp
source: Src.: Source of the bank/preset to import Des.: Bank/Preset to assign to the imported one. Leave Src. Bank and Src. Preset to 0 for SFZ files.
es_es: Src.: Fuente del banco/Preset para importar Des.: Banco/Preset para asignar al importado. Deje Src. Bank y Src. Preset en 0 para archivos SFZ.
zh_cn: “导入位置…”显示添加的MIDI的默认Bank/Preset标识。 如果在“导入位置…”中单独指定了Bank/Preset的ID，则默认的Bank/Preset的ID将重新指定为此处指定的ID。 如果选定的音色库为SFZ，则Bank/Preset的ID将自动指定为0。
zh_hk: “導入位置…”顯示添加嘅MIDI嘅默認Bank/Preset標識。 如果喺“導入位置…”中單讀指定咗Bank/Preset嘅ID，則默認嘅Bank/Preset嘅ID將重新指定為此處指定嘅ID。 如果選定嘅音色庫為SFZ，則Bank/Preset嘅ID將自動設定為0。

# BNPSelWiki
source: Banks/Presets list
es_es: Listado de bancos/Presets
zh_cn: 库/预设列表
zh_hk: 庫/預設列表

# CancelBtn
source: Cancel
es_es: Cancelar
zh_cn: 取消
zh_hk: 取消

# ConfirmBtn
source: Confirm
es_es: Confirmar
zh_cn: 确定
zh_hk: 確定

# DesBank
source: Destination ID of the imported bank:
es_es: ID de destino del banco importado:
zh_cn: 导入库的目标ID：
zh_hk: 導入庫的目標ID：

# DesPreset
source: Destination ID of the imported preset:
es_es: ID de destino del preset importado:
zh_cn: 导入预设的目标ID：
zh_hk: 導入預設的目標ID：

# SrcBank
source: Source ID of the bank to import:
es_es: ID de fuente del banco a importar:
zh_cn: 导入库的源ID：
zh_hk: 導入庫的源ID：

# SrcPreset
source: Source ID of the preset to import:
es_es: ID de fuente del preset para importar:
zh_cn: 导入预设的源ID：
zh_hk: 導入預設的源ID：

# 0Translators0
source: Riccardo Loi
es_es: TheWonder[Wp]
zh_cn: 节能降耗 与 纳新基地的大家
zh_hk: Whoncxis（基於【節能降耗】的漢化範本粵化）

# AdvancedVoicesChannel
source: Channel {0}:
es_es: Canal {0}:
zh_cn: 通道 {0}：
zh_hk: 通道 {0}：

# AdvancedVoicesTitle
source: Active voices - Advanced (CPU usage: {0}%)
es_es: Activar voces - Avanzado (Uso del CPU: {0}%)
zh_cn: 活动复音数 - 详细（CPU使用率：{0}%）
zh_hk: 活動復音數 - 詳細（CPU使用率：{0}%）

# AppBusy
source: The app is not done converting/playing MIDIs! Are you sure you want to exit?
es_es: ¡La aplicación no ha terminado de convertir/reproducir MIDI! ¿Estás seguro/a de que quieres salir?
zh_cn: 软件还没有转换/播放完MIDI！ 真的要关闭吗？
zh_hk: 軟件仲未有轉換/預覽完MIDI！ 真係要關閉嗎？

source: Audio settings
es_es: Configuracion de audio
zh_cn: 音频设置
zh_hk: 音頻設定

# AutoResizeColumns
source: Resize the columns
es_es: Cambiar el tamaño de las columnas
zh_cn: 自动调整列大小
zh_hk: 自動調整列大小

# BecomeAPatronTitle
source: Become a patron to keep the project alive
es_es: Conviértete en un Patreon para mantener vivo el proyecto.
zh_cn: 成为赞助者拯救这个项目
zh_hk: 成為贊助者拯救呢個項目

source: Channels settings
es_es: Configuración de canales
zh_cn: 通道设置
zh_hk: 通道設定

# ChannelsSettingsAll
source: All
es_es: Todos
zh_cn: 总通道
zh_hk: 總通道

# ChannelsSettingsChan
source: Channel {0}
es_es: Canal {0}
zh_cn: 通道{0}
zh_hk: 通道{0}

source: Conversion aborted.
es_es: Conversión abortada.
zh_cn: 转换已中断。
zh_hk: 轉換已停止。
