Repository: KeppySoftware/KMC
Catalog: KeppyMIDIConverter/Languages/Lang.*.resx
Languages: es_es, zh_cn, zh_hk

source: Conversion completed.
es_es: Conversión completada.
zh_cn: 转换已完成。
zh_hk: 轉換已暫停。

# CopiedToClipboardNotice
source: The error has been copied to clipboard.
es_es: El error se ha copiado al portapapeles.
zh_cn: 错误信息已复制到剪贴板。
zh_hk: 錯誤信息已複製至剪貼簿。

# CopyErrorMessage
source: Copy error message to clipboard
es_es: Copiar mensaje de error al portapapeles
zh_cn: 将错误信息复制到剪贴板
zh_hk: 將錯誤信息複製至剪貼簿

source: Empty slot
es_es: Ranura vacía
zh_cn: 空插槽
zh_hk: 空插槽

# HeyYou
source: Hey!
es_es: Oye tu!
zh_cn: 等一下嘛！
zh_hk: 等一陣啦！

# InvalidVSTLoaded
source: {0} is not a valid VST effect! Be sure to load a VST effect and NOT a VST instrument. If you're trying to use a {1} VST, you need to use a {1} version of Keppy's MIDI Converter too. The {2} version of Keppy's MIDI Converter does NOT support {1} VSTs and viceversa.
es_es: {0} ¡no es un efecto VST válido!. Asegúrese de cargar un efecto VST y NO un instrumento VST. Si está intentando utilizar un {1} VST, también debe utilizar una versión {1} del convertidor MIDI de Keppy. La versión {2} del convertidor MIDI de Keppy NO es compatible con {1} VST y viceversa.
zh_cn: {0}不是有效的VST效果器！ 请确定你加载的是VST效果器，而非VSTi（VST乐器）。 如果要使用{1}VST，就需要{1}版本的Keppy's MIDI Converter。 另外，{2}版本的Keppy's MIDI Converter同样不能使用{1}VST。
zh_hk: {0}唔係有效嘅VST效果器！ 請確定您加載嘅係VST效果器，而唔係VSTi（VST樂器）。 如果要使用{1}VST，就需要{1}版本嘅Keppy's MIDI Converter。 另外，{2}版本嘅Keppy's MIDI Converter同樣唔可以使用{1}VST。

# LegalWarningVSTi
source: By clicking 'Yes', you agree not to abuse the 'VST instrument' feature to create, disseminate, or make accessible anything exploiting the copyrighted/protected samples or files included within a VST ("Visual Studio Technology" plugin). Such resultant files could include (but are not limited to): SoundFonts, VSTs, or any other usable tool that commits copyright infringement. Simply put it, you may not use this tool to commit piracy on a copyrighted/trademarked/protected VST, free or paid, unless you have permission from the developer. You may create audio at will from the VST, but DO NOT use this export feature to extract/"rip" samples from the VST. The author assumes no legal responsibility from the use of this tool.
es_es: Al hacer clic en 'Sí', acepta no abusar de la función 'Instrumento VST' para crear, difundir o hacer accesible cualquier cosa que explote las muestras o archivos protegidos por derechos de autor incluidos en un VST (complemento de "Tecnología Visual Studio"). Dichos archivos resultantes podrían incluir (pero no se limitan a): SoundFonts, VST o cualquier otra herramienta utilizable que infrinja los derechos de autor. En pocas palabras, no puede usar esta herramienta para cometer piratería en un VST con derechos de autor / marca registrada / protegido, gratis o de pago, a menos que tenga permiso del desarrollador.. Puede crear audio a voluntad desde el VST, pero NO utilice esta función de exportación para extraer / "copiar" muestras del VST. El autor no asume ninguna responsabilidad legal por el uso de esta herramienta..
zh_cn: 单击“是”，即表示您同意不滥用“VST instrument”功能来创建、传播或访问利用VST中包含的受版权保护/保护的样本或文件的任何内容（“Visual Studio技术”插件）。 此类结果文件可能包括（但不限于）： SoundFonts、VST或任何其他侵犯版权的可用工具。 简单地说，除非获得开发者的许可，否则您不得使用此工具在受版权保护/商标保护/免费或付费的VST上实施盗版。 您可以随意从VST创建音频，但不要使用此导出功能从VST提取/破解样本。 作者对使用此工具不承担任何法律责任。
zh_hk: 單擊“是”，即表示您同意不濫用“VST工具”功能來創建、傳播或訪問任何利用咗【包含於VST（“Virtual Studio技術”插件）中受保護或版權保護嘅範本或文件】嘅內容。 會引發此類結果嘅文件包括（但不限於）： SoundFonts、VST或任何其它侵犯版權嘅可用工具。 簡單來講，除非獲得開發者嘅許可，否則您不得使用此工具係受版權保護/商標保護/免費或護費嘅VST上實施盜版。 您可以隨意從VST創建音頻，但不要用此導出功能從VST提取/破解範本。 作者對使用此工具不承擔任何法律責任。

# LoadVST
source: Load
es_es: Cargar
zh_cn: 加载
zh_hk: 加載

# MaxVoices
source: Maximum voices:
es_es: Voces máx.:
zh_cn: 最大复音数：（最高可设置为100,000）
zh_hk: 最大複音數：（最高可設定為100,000）

# MemoryAllocationConversion
source: The application is allocating memory for the conversion process. Please wait...
es_es: La aplicación está asignando memoria para el proceso de conversión. Espere por favor...
zh_cn: 应用程序正在为转换过程分配内存。 请稍候...
zh_hk: 應用正在正在為轉換過程分配內存。 請稍候...

# MemoryAllocationConversionVST
source: The application is allocating memory for the conversion process. Edit the VST DSPs settings when asked. Please wait...
es_es: La aplicación está asignando memoria para el proceso de conversión. Edite la configuración de VST DSP cuando se le solicite. Espere por favor...
zh_cn: 应用程序正在为转换过程分配内存。 记得根据要求编辑VST DSP设置哦。请稍候...
zh_hk: 軟體程序正在為轉換過程分配內存。 記得去調VST DSP設定並關閉窗體喔。 請稍候...

# MemoryAllocationPlayback
source: The application is allocating memory for the preview. Please wait...
es_es: La aplicación está asignando memoria para la vista previa. Espere por favor...
zh_cn: 应用程序正在为预览分配内存。 请稍候...
zh_hk: 軟體程序正在為預覽分配內存。 請稍候...

# MemoryAllocationPlaybackVST
source: The application is allocating memory for the preview. Edit the VST DSPs settings when asked. Please wait...
es_es: La aplicación está asignando memoria para la vista previa. Edite la configuración de VST DSP cuando se le solicite. Espere por favor...
zh_cn: 应用程序正在为预览分配内存。 记得根据要求编辑VST DSP设置哦。请稍候...
zh_hk: 軟體程序正在為預覽分配內存。 記得去調VST DSP設定並關閉窗體喔。 請稍候...

# MIDITracks
source: Tracks
zh_cn: 轨道数
zh_hk: 軌道數

source: Not verified
es_es: No verificado
zh_cn: 未验证
zh_hk: 未認證

# OverrideLanguage
source: Override default UI language
es_es: Anular el idioma predeterminado de la interfaz de usuario
zh_cn: 覆盖原语言
zh_hk: 覆蓋默認語言

# PatreonBecomeOne
source: Become a patron
es_es: Conviértete en un Patreon
zh_cn: 成为赞助者
zh_hk: 成為贊助者

# PatreonDesc
source: This project can not maintain itself by downloads only. I will not be able to keep this program updated forever, that's why becoming a patron could help me improve its features, and also help me improve the equipment that I work with. Becoming one is completely optional, and if you don't want to see this dialog anymore, just click on "Do not show this ever again". You can still become one by navigating to "Help > Become a patron". Thank you in advance.
es_es: Este proyecto no puede mantenerse solo mediante descargas.. No podré mantener este programa actualizado para siempre, es por eso que convertirte en socio de Patreon podría ayudarme a mejorar sus características y también ayudarme a mejorar el equipo con el que trabajo. Convertirse en uno es completamente opcional, y si no desea ver más este cuadro de diálogo, simplemente haga clic en "No mostrar esto nunca más". Aún puedes convertirte en uno navegando a "Help > Conviértete en Patreon". Gracias de antemano.
zh_cn: 这个项目不能仅通过下载来维护自身。 我无法永远更新这个程序，所以你们的一笔小捐款可以帮助我改进它的功能，与我使用的设备。 捐款是可选的，如果你不想再看到这个对话框，只需点击“不再显示”。您仍然可以打开“帮助>赞助”进行捐款。 提前谢谢你啦。
zh_hk: 呢個項目唔能夠僅通過下載來維護自身。 我無辦法永遠更新呢個程序，所以您們嘅一筆小捐款可以協助我改進佢嘅功能，與我使用嘅設備。 捐款係可選嘅，如果您唔想再見到呢一個對話框，只需點擊“不再顯示”。您仍然可以打開“幫助>贊助”進行捐款。 提前多謝您啦。

# PatreonMaybeLater
source: Maybe later
es_es: Quizas mas tarde
zh_cn: 下次一定
zh_hk: 下次先算

source: Playback aborted.
es_es: Reproducción abortada.
zh_cn: 播放已中断。
zh_hk: 預覽已停止。

source: Playback completed.
es_es: Reproducción completada.
zh_cn: 播放已完成。
zh_hk: 預覽已完成。

# PlaybackStatusSlower
source: {0} of the MIDI played. Position: {1} - {2} Notes: {3} - {4} Playback speed: ({5}x~ slower)
es_es: {0} del MIDI reproducido. Posicion: {1} - {2} Notas: {3} - {4} Velocidad de reproducción: ({5}x~ mas lento)
zh_cn: MIDI已经播放了{0}。 播放位置：{1} - {2} 音符数：{3} - {4} 播放速度：({5}x慢速~）
zh_hk: MIDI已經預覽咗{0}。 預覽位置：{1} - {2} 音符數：{3} - {4} 預覽速度：({5}x慢於播放速度~）

# UnloadAllVSTs
source: Remove all
es_es: Eliminar todo
zh_cn: 全部卸载
zh_hk: 移除所有

# UnloadVST
source: Unload
es_es: Descargar
zh_cn: 卸载
zh_hk: 移除

# VSTiModeOn
source: VSTi mode activated.
es_es: Modo VSTi activado.
zh_cn: 已开启VSTi模式。
zh_hk: 已開啟VSTi模式。

# VSTiModeOnLegal
source: VSTi mode activated. The legal warning will not be displayed anymore.
es_es: Modo VSTi activado. La advertencia legal ya no se mostrará.
zh_cn: 已开启VSTi模式。 法律警告将不再显示。
zh_hk: 已開啟VSTi模式。 法律警告將不再顯示。

# VSTNameAndVersion
source: {0} by {1} (Version number: {2})
es_es: {0} por {1} (Número de versión: {2})
zh_cn: {0} 作者 {1}（版本号：{2}）
zh_hk: {0} 作者 {1}（版本號：{2}）

source: Warning
es_es: Advertencia
zh_cn: 注意
zh_hk: 注意

# ConversionText
source: {0} | Conversion of {1}...
es_es: {0} | Conversión de {1}...
zh_cn: {0} | 正在转换 {1}
zh_hk: {0} | 正在轉換 {1}

source: Donate
es_es: Donar
zh_cn: 赞助
zh_hk: 贊助

# CopyText
source: Copy
es_es: Copiar
zh_cn: 复制
zh_hk: 複製

# ParsingMIDIInfo
source: Parsing information about MIDIs...
es_es: Analizar información sobre MIDIs...
zh_cn: 正在解析MIDI信息...
zh_hk: 正在解析MIDI信息...

# ParsingMIDIInfoStatus
source: Parsed {0} file(s) out of {1}. Please wait...
es_es: Analizado {0} MIDI(s) fuera de {1}. Espere por favor
zh_cn: {1}个文件中已解析{0}个文件。 请稍候...
zh_hk: {1}個文件中已解析{0}個文件。 請稍候...

# SVDS
source: Skip VST DSPs settings
es_es: Saltar la configuración de DSP VST
zh_cn: 跳过VST DSP设置
zh_hk: 跳過VST DSP設定

# Unavailable
source: Unvailable
es_es: No disponible
zh_cn: 不可用
zh_hk: 不可用

source: VSTi settings
es_es: Configuración de VSTi
zh_cn: VSTi设置
zh_hk: VSTi設定

# CorruptedSetupDesc
source: The updated setup for the converter is corrupted. Can not install update! Press OK to continue.
es_es: La configuración actualizada del convertidor está dañada. ¡No se puede instalar la actualización!! Presione OK para continuar.
zh_cn: 更新安装包已损坏。 无法安装更新！ 点击确定以继续。
zh_hk: 更新安裝包已損壞。 無法安裝更新！ 點擊確定來繼續。

# CorruptedSetupTitle
source: Corrupted setup
es_es: Configuración corrupta
zh_cn: 安装包一不小心就损坏了...
zh_hk: 安裝包一唔覺意損壞咗...

# MissingTranslations
source: Some languages might not be available yet.
es_es: Es posible que algunos idiomas aún no estén disponibles.
zh_cn: 部分语言仍未实装。敬请期待。
zh_hk: 部分語言總未擁有，敬请期待。

# MTT
source: Minimize to tray
es_es: Minimizar a la bandeja
zh_cn: 最小化到托盘
zh_hk: 最小化到託盤

# SBIOMB
source: Show balloons/toast notifications instead of message boxes
es_es: Mostrar globos/notificaciones de brindis en lugar de cuadros de mensaje
zh_cn: 显示气球/墙角框通知，而不是消息框。
zh_hk: 顯示氣球/牆角框通知，而唔是消息框。

# MinimizedToTray
source: The converter has been minimized to tray. Click the icon on the system tray to restore it.
es_es: El convertidor se ha minimizado a la bandeja. Click en el icono de la bandeja del sistema para restaurarlo.
zh_cn: 转换器已最小化到托盘。 单击系统托盘上的图标将其还原。
zh_hk: 轉換器已最小化至託盤。 單擊系統託盤上嘅圖標將其還原。

# SincInter
source: Enable 32 point sinc interpolation
es_es: Habilitar la interpolación sinc de 32 puntos
zh_cn: 启用32点辛格插值（提高音质）
zh_hk: 使用32點sinc函數插值代替線性函數插值

# ArgumentError
source: Invalid argument
es_es: Argumento no válido
zh_cn: 无效参数
zh_hk: 無效參數

# InvalidArg
source: {0} is not a valid command line argument! Click OK to continue.
es_es: {0} no es un argumento de línea de comando válido. Click OK para continuar.
zh_cn: {0}不是有效的命令行参数！ 点击确定来继续.
zh_hk: {0}唔是有效嘅命令行參數！ 點擊確定來繼續.

# SelectedSF
source: Selected SoundFont: {0}
es_es: Soundfont seleccionada: {0}
zh_cn: 选择的音色库： {0}
zh_hk: 選擇的音色庫： {0}

# PreloadDefaultSF
source: Always preload the default SoundFont, if present.
es_es: Siempre precargue el SoundFont predeterminado, si está presente.
zh_cn: 如果有的话，总是预加载音色库。
zh_hk: 如果有嘅話，總係預加載軟件默認嘅音色庫。

# AFIT
source: Show ignore tracks dialog before export
es_es: Mostrar el cuadro ignorar pistas antes de exportar
zh_cn: 导出之前展示“忽略轨道”对话框。
zh_hk: 導出前展示“忽略軌道”對話框。

# HighestVel
source: Highest:
es_es: Mas alta:
zh_cn: 最高：
zh_hk: 最高：

# IgnoreNotes1
source: Ignore notes in between two velocity values
es_es: Ignorar notas entre dos valores de velocidad
zh_cn: 忽略两个力度值之间的音符
zh_hk: 忽略兩個力度值之間的音符

# Limit88
source: Limit key range to 88 keys (Excluding drums channel)
es_es: Limite del rango a 88 teclas (Excluyendo el canal de batería (Drums))
zh_cn: 将音符限制为88键（鼓通道除外）
zh_hk: 將音符限定在88鍵（鼓通道除外）

# LowestVel
source: Lowest:
es_es: Más baja:
zh_cn: 最低：
zh_hk: 最低：

source: MIDI events settings
es_es: Configuración de eventos MIDI
zh_cn: MIDI事件设置
zh_hk: MIDI事件設定

# TracksToIgnoreTitle
source: Which tracks do you want to ignore?
es_es: ¿Qué pistas quieres ignorar?
zh_cn: 你想要忽略哪条轨道？
zh_hk: 您要忽略邊一條軌道？

# PreloadSamplesNotSF
source: Preload the required samples, rather than the entire SoundFonts.
es_es: Cargue previamente las muestras necesarias, en lugar de todos las SoundFonts.
zh_cn: 只预加载需要的采样，而非整个音色库。
zh_hk: 只預加載需要嘅採樣，而非整個音色庫。

# PreloadSamplesNotSFWarn
source: Preloading the samples will force the converter to scan the entire MIDI, to check which samples need to be preloaded. This behavior might make the converter stall in the check for minutes, even hours, depending on how big both the MIDI and the SoundFonts are. For Black MIDI playback/conversion, it is highly suggested to leave this option unchecked.
es_es: Precargando las muestras obligará al convertidor a escanear todo el MIDI para comprobar qué muestras deben precargarse. Este comportamiento puede hacer que el convertidor se detenga en la comprobación durante minutos, incluso horas, dependiendo del tamaño de MIDI y SoundFonts. Para la reproducción/conversión de Black MIDI, se recomienda dejar esta opción sin marcar.
zh_cn: 预加载样本将强制使转换器扫描整个MIDI，以检查哪些样本需预加载。 根据MIDI和音色库的大小，这种行为可能会使转换器在检查中暂停几分钟甚至几个小时。 对于【黑乐谱】的播放/转换，强烈建议不要选中此选项。
zh_hk: 預加載范本將強制使轉換器掃描整個MIDI，已檢查邊啲範本需預加載。 根據MIDI和音色庫嘅大小，呢種行為可能會使轉換器喺檢查中暫停幾分鐘甚至幾個鐘。 對於【黑樂譜】嘅預覽/轉換，強烈建議不要選中此選項。

# PreloadSFOfMIDI
source: Preloads SoundFonts with the same name and path as the MIDI.
es_es: Precarga SoundFonts con el mismo nombre y ruta que el MIDI.
zh_cn: 预加载与MIDI具有相同名称和路径的音色库。
zh_hk: 預加載與MIDI具有相同名稱和路徑的音色庫。

# ParsingMIDIInfoInvalidOutcome
source: Out of {0} files, {1} were valid and {2} were invalid.
es_es: Fuera de {0} archivos, {1} eran válidos y {2} Eran inválidos.
zh_cn: 在{0}个文件当中,{1}个有效，{2}个无效。
zh_hk: 在{0}個文件當中,{1}個有效，{2}個無效。

# ParsingMIDIInfoPrepare
source: Preparing. Please wait...
es_es: Preparando. Por favor espera...
zh_cn: 准备中。 请稍候...
zh_hk: 準備中。 請稍候...
